/*Задание 1
Ввести начальное показание счётчика P(0..10000) и n(1..20) последующих ежедневных показаний.
В цикле for расход дня равен разности нового и предыдущего показаний.
Если новое показание меньше предыдущего, вывести ошибку и завершить программу.
Определить общий расход, наибольший дневной расход и номер дня с ним(первый при равенстве).*/

#include  <iostream>
using namespace std;

int main() {
	setlocale(LC_ALL, "Russian");
	int P = -1, p = 0;
	int def = 0, def_ = -1, n = 1, n_ = 0;
	while (P < 0 || P > 10000) {
		cout << "\nВведите начальное значение: \n";
		cin >> P;
		if(P < 0 || P > 10000)
			cout << "\nНеверное значение, введите снова: \n";
	}
	for (;n <= 20; n++) {
		cout << "Введите значение за "<< n << " день: \n";
		cin >> p;
		if (p < P)
			break;
		def += p - P;
		if (p - P > def_) {
			def_ = p - P;
			n_ = n;
		}
		P = p;
	}
	cout << "\n\nИтоговый расход за весь период: " << def;
	cout << "\n\nНаибольший расход за день: " << def_;
	cout << "\n\nНаибольший расход был за день номер " << n_;
}